# Задача 1
# Создайте несколько переменных разных типов.
# Проверьте к какому типу относятся созданные переменные.

a = 10
b = 0.5
c = 'taxt'
d = [a, b]
e = {c: a}
f = True
print(f'Объект {a} имеет тип {type(a)}')
print(f'Объект {b} имеет тип {type(b)}')
print(f'Объект {c} имеет тип {type(c)}')
print(f'Объект {d} имеет тип {type(d)}')
print(f'Объект {e} имеет тип {type(e)}')
print(f'Объект {f} имеет тип {type(f)}')
